union DeviceTvmSoftwareVulnerabilities, CloudAppEvents
| join kind=inner (DeviceTvmSoftwareVulnerabilitiesKB) on CveId
| where VulnerabilitySeverityLevel in ("Medium", "High", "Critical", "Low")
| summarize UniqueCveCount = dcount(CveId1) by VulnerabilitySeverityLevel
| render columnchart 