union DeviceTvmSoftwareVulnerabilities, CloudAppEvents
| join kind=inner (DeviceTvmSoftwareVulnerabilitiesKB) on CveId
| extend formatted_date = format_datetime(PublishedDate, 'yyyy-MM-dd')
| extend vulnerability_age_days = datetime_diff('day', now(), PublishedDate)
| summarize device_count = dcount(DeviceId) by CveId, vulnerability_age_days, VulnerabilitySeverityLevel
| order by device_count, vulnerability_age_days
| project vulnerability_age_days, device_count, CveId
